'''
Задача «Hello, Harry!»
Условие
Напишите программу, которая приветствует пользователя,
выводя слово Hello, введенное имя и знаки препинания по образцу: 
 '''

name = str(input())
print("Hello, {}!".format(name))