'''
Задача «Минимум из двух чисел»
Условие
Даны два целых числа. Выведите значение наименьшего из них. 
'''

x = int(input())
y = int(input())

print(x) if x<y else print(y)