'''
Задача «Минимум из трех чисел»
Условие
Даны три целых числа. Выведите значение наименьшего из них. 
 '''

a = int(input())
b = int(input())
c = int(input())
    
print(min(a, b, c))